class Constants:
    """
    各定数
     画像リソース内の各画像を切り出す際の起点(左上のドットxy座標)
     各画像のサイズ
    """

    IMAGE_NUMBERS = [
        [0, 0],  # 1
        [5, 0],  # 2
        [10, 0],  # 3
        [15, 0],  # 4
        [20, 0],  # 5
        [25, 0],  # 6
        [30, 0],  # 7
        [35, 0],  # 8
        [40, 0],  # 9
        [45, 0],  # 10
        [50, 0],  # J
        [55, 0],  # Q
        [60, 0],  # K
    ]

    IMAGE_NUMBER_W_H = [5, 5]

    IMAGE_CARD_BACKGROUND = [
        [0, 50],  # 1
        [0, 50],  # 2
        [0, 50],  # 3
        [0, 50],  # 4
        [0, 50],  # 5
        [0, 50],  # 6
        [0, 50],  # 7
        [0, 50],  # 8
        [0, 50],  # 9
        [0, 50],  # 10
        [0, 5],  # J
        [40, 5],  # Q
        [80, 5],  # K
    ]

    IMAGE_CARD_W_H = [40, 32]

    IMAGE_MARKS = [
        [0, 40],  # Hearts
        [7, 40],  # Diamonds
        [14, 40],  # Clubs
        [21, 40],  # Spades
    ]

    IMAGE_MARK_W_H = [7, 6]
